BOQ/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеОтчетыИОбработки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаОтчет</name>
    <type>
      <types>EnumRef.ОбработкаОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Общий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BOQ/src/Enums/ОбработкаОтчет/ОбработкаОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбработкаОтчет</name>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
</mdclass:Enum>

BOQ/src/Catalogs/ДополнительныеОтчетыИОбработки/Forms/ВыборОбработкиОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	установитьЗначенияПараметров ();
	сформироватьЗаголовок ();
		
КонецПроцедуры

&НаСервере
Процедура установитьЗначенияПараметров ()
	
	Список.Параметры.УстановитьЗначениеПараметра ( "Раздел", Параметры.Раздел );
	Список.Параметры.УстановитьЗначениеПараметра ( "ОбработкаОтчет", Параметры.ОбработкаОтчет );
	Список.Параметры.УстановитьЗначениеПараметра ( "ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь );		
	
КонецПроцедуры

&НаСервере
Процедура сформироватьЗаголовок ()
	
	Если ( Параметры.ОбработкаОтчет = ПредопределенноеЗначение ( "Перечисление.ОбработкаОтчет.Обработка" ) ) Тогда
		Заголовок = Сообщения.ТекстПоИД ( "ОбработкиПоРазделу", Новый Структура ( "Раздел", Параметры.Раздел ) );
	ИначеЕсли ( Параметры.ОбработкаОтчет = ПредопределенноеЗначение ( "Перечисление.ОбработкаОтчет.Отчет" ) ) Тогда
		Заголовок = Сообщения.ТекстПоИД ( "ОбработкиПоОтчету", Новый Структура ( "Раздел", Параметры.Раздел ) );
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокВыбор ( Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	текущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ( текущаяСтрока <> Неопределено ) Тогда
		форма = подключитьОтчетОбработку ( текущаяСтрока );
		Если ( форма = "" ) Тогда
			Возврат;
		КонецЕсли; 
		п = Новый Структура ();
		ОткрытьФорму ( форма + ".Форма", п, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.Независимый );
		Закрыть ();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция подключитьОтчетОбработку ( Данные )
	
	Возврат РаботаСФайлами.ПодключитьВнешнююОбработкуОтчет ( Данные );

КонецФункции
